Repository: stokay/MySQLClient
Catalog: Sources/MySQLMacClient/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, it, ja, ko, pl, pt_br, ru, th, tr, vi, zh_hans, zh_hant

source: Only the table structure is created — no records are imported. Review the suggested types below before creating.
ar: يتم إنشاء بنية الجدول فقط — لا يتم استيراد أي سجلات. راجع الأنواع المقترحة أدناه قبل الإنشاء.
de: Es wird nur die Tabellenstruktur erstellt — es werden keine Datensätze importiert. Überprüfen Sie die vorgeschlagenen Typen unten, bevor Sie erstellen.
es: Solo se crea la estructura de la tabla — no se importan registros. Revisa los tipos sugeridos a continuación antes de crear.
fr: Seule la structure de la table est créée — aucun enregistrement n'est importé. Vérifiez les types suggérés ci-dessous avant de créer.
hi: केवल टेबल संरचना बनाई जाती है — कोई रिकॉर्ड आयात नहीं किया जाता। बनाने से पहले नीचे सुझाए गए प्रकार देख लें।
id: Hanya struktur tabel yang dibuat — tidak ada data yang diimpor. Tinjau tipe yang disarankan di bawah sebelum membuat.
it: Viene creata solo la struttura della tabella — nessun record viene importato. Rivedi i tipi suggeriti qui sotto prima di creare.
ja: テーブル構造のみが作成され、レコードはインポートされません。作成前に、以下の推奨される型を確認してください。
ko: 테이블 구조만 생성되며 레코드는 가져오지 않습니다. 생성하기 전에 아래 제안된 형식을 검토하세요.
pl: Tworzona jest tylko struktura tabeli — żadne rekordy nie są importowane. Przed utworzeniem sprawdź proponowane poniżej typy.
pt_br: Somente a estrutura da tabela é criada — nenhum registro é importado. Revise os tipos sugeridos abaixo antes de criar.
ru: Создаётся только структура таблицы — записи не импортируются. Перед созданием проверьте предложенные ниже типы.
th: จะสร้างเฉพาะโครงสร้างตาราง — จะไม่มีการนำเข้าข้อมูลใด ๆ โปรดตรวจสอบชนิดข้อมูลที่แนะนำด้านล่างก่อนสร้าง
tr: Yalnızca tablo yapısı oluşturulur — kayıtlar içe aktarılmaz. Oluşturmadan önce aşağıdaki önerilen tipleri gözden geçirin.
vi: Chỉ cấu trúc bảng được tạo — không có bản ghi nào được nhập. Hãy xem lại các kiểu dữ liệu được đề xuất bên dưới trước khi tạo.
zh_hans: 仅创建表结构 — 不导入任何记录。创建前请检查下方建议的类型。
zh_hant: 僅會建立表格結構 — 不會匯入任何記錄。建立前請檢查下方建議的類型。

source: Optional
ar: اختياري
es: Opcional
fr: Facultatif
hi: वैकल्पिक
id: Opsional
it: Facoltativo
ja: 任意
ko: 선택 사항
pl: Opcjonalne
pt_br: Opcional
ru: Необязательно
th: ไม่บังคับ
tr: Opsiyonel
vi: Tùy chọn
zh_hans: 可选
zh_hant: 可選

source: Optional — lists all if empty
ar: اختياري — يعرض الكل إذا كان فارغًا
de: Optional — bei leerem Feld werden alle aufgelistet
es: Opcional — si está vacío, se listan todos
fr: Facultatif — liste tout si vide
hi: वैकल्पिक — खाली होने पर सभी सूचीबद्ध होंगे
id: Opsional — jika kosong, semua akan ditampilkan
it: Facoltativo — elenca tutto se vuoto
ja: 任意 — 空の場合はすべて表示
ko: 선택 사항 — 비워 두면 전체 표시
pl: Opcjonalne — jeśli puste, wyświetla wszystkie
pt_br: Opcional — lista tudo se vazio
ru: Необязательно — если пусто, выводятся все
th: ไม่บังคับ — หากเว้นว่างจะแสดงทั้งหมด
tr: Opsiyonel — boşsa tümü listelenir
vi: Tùy chọn — để trống sẽ liệt kê tất cả
zh_hans: 可选 — 留空则列出全部
zh_hant: 可選 — 留空則列出全部

source: Page size:
ar: حجم الصفحة:
de: Seitengröße:
es: Tamaño de página:
fr: Taille de page :
hi: पेज आकार:
id: Ukuran halaman:
it: Dimensione pagina:
ja: ページサイズ:
ko: 페이지 크기:
pl: Rozmiar strony:
pt_br: Tamanho da página:
ru: Размер страницы:
th: ขนาดหน้า:
tr: Sayfa boyutu:
vi: Kích thước trang:
zh_hans: 分页大小：
zh_hant: 分頁大小：

source: Password
ar: كلمة المرور
de: Passwort
es: Contraseña
fr: Mot de passe
hi: पासवर्ड
id: Kata Sandi
ja: パスワード
ko: 비밀번호
pl: Hasło
pt_br: Senha
ru: Пароль
th: รหัสผ่าน
tr: Şifre
vi: Mật khẩu
zh_hans: 密码
zh_hant: 密碼

source: Permanently delete the %@ '%@'?
ar: هل تريد حذف %1$@ '%2$@' نهائيًا؟
de: %@ „%@“ dauerhaft löschen?
es: ¿Eliminar %@ "%@" permanentemente?
fr: Supprimer définitivement %1$@ « %2$@ » ?
hi: %1$@ '%2$@' को स्थायी रूप से हटाएँ?
id: Hapus %@ '%@' secara permanen?
it: Eliminare definitivamente %1$@ '%2$@'?
ja: %1$@ '%2$@' を完全に削除しますか？
ko: %1$@ '%2$@'을(를) 영구적으로 삭제하시겠습니까?
pl: Trwale usunąć %1$@ „%2$@”?
pt_br: Excluir permanentemente %1$@ '%2$@'?
ru: Удалить %1$@ «%2$@» безвозвратно?
th: ลบ %@ '%@' อย่างถาวรหรือไม่?
tr: '%@' '%@' tamamen silinsin mi?
vi: Xóa vĩnh viễn %@ '%@'?
zh_hans: 永久删除 %1$@ “%2$@”？
zh_hant: 永久刪除 %1$@「%2$@」？

source: Permanently delete the table '%@'?
ar: هل تريد حذف الجدول '%@' نهائيًا؟
de: Tabelle „%@“ dauerhaft löschen?
es: ¿Eliminar la tabla "%@" permanentemente?
fr: Supprimer définitivement la table « %@ » ?
hi: टेबल '%@' को स्थायी रूप से हटाएँ?
id: Hapus tabel '%@' secara permanen?
it: Eliminare definitivamente la tabella '%@'?
ja: テーブル '%@' を完全に削除しますか？
ko: 테이블 '%@'을(를) 영구적으로 삭제하시겠습니까?
pl: Trwale usunąć tabelę „%@”?
pt_br: Excluir permanentemente a tabela '%@'?
ru: Удалить таблицу «%@» безвозвратно?
th: ลบตาราง '%@' อย่างถาวรหรือไม่?
tr: '%@' tablosu tamamen silinsin mi?
vi: Xóa vĩnh viễn bảng '%@'?
zh_hans: 永久删除表 “%@”？
zh_hant: 永久刪除表格「%@」？

source: Permanently delete the view '%@'?
ar: هل تريد حذف العرض '%@' نهائيًا؟
de: Ansicht „%@“ dauerhaft löschen?
es: ¿Eliminar la vista "%@" permanentemente?
fr: Supprimer définitivement la vue « %@ » ?
hi: व्यू '%@' को स्थायी रूप से हटाएँ?
id: Hapus view '%@' secara permanen?
it: Eliminare definitivamente la vista '%@'?
ja: ビュー '%@' を完全に削除しますか？
ko: 뷰 '%@'을(를) 영구적으로 삭제하시겠습니까?
pl: Trwale usunąć widok „%@”?
pt_br: Excluir permanentemente a view '%@'?
ru: Удалить представление «%@» безвозвратно?
th: ลบมุมมอง '%@' อย่างถาวรหรือไม่?
tr: '%@' view'ı tamamen silinsin mi?
vi: Xóa vĩnh viễn khung nhìn '%@'?
zh_hans: 永久删除视图 “%@”？
zh_hant: 永久刪除檢視表「%@」？

source: Port must be numeric.
ar: يجب أن يكون المنفذ رقميًا.
de: Port muss numerisch sein.
es: El puerto debe ser numérico.
fr: Le port doit être numérique.
hi: पोर्ट संख्यात्मक होना चाहिए।
id: Port harus berupa angka.
it: La porta deve essere numerica.
ja: ポートは数値で指定してください。
ko: 포트는 숫자여야 합니다.
pl: Port musi być liczbą.
pt_br: A porta deve ser numérica.
ru: Порт должен быть числом.
th: พอร์ตต้องเป็นตัวเลข
tr: Port sayısal olmalı.
vi: Cổng phải là số.
zh_hans: 端口必须为数字。
zh_hant: 連接埠必須為數字。

source: Procedure
ar: الإجراء
de: Prozedur
es: Procedimiento
fr: Procédure
hi: प्रोसीज़र
id: Prosedur
it: Procedura
ja: プロシージャ
ko: 프로시저
pl: Procedura
pt_br: Procedimento
ru: Процедура
th: โพรซีเจอร์
vi: Thủ tục
zh_hans: 存储过程
zh_hant: 預存程序

source: Procedure names
ar: أسماء الإجراءات
de: Prozedurnamen
es: Nombres de procedimiento
fr: Noms des procédures
hi: प्रोसीज़र नाम
id: Nama prosedur
it: Nomi procedura
ja: プロシージャ名
ko: 프로시저 이름
pl: Nazwy procedur
pt_br: Nomes dos procedimentos
ru: Имена процедур
th: ชื่อโพรซีเจอร์
tr: Procedure adları
vi: Tên thủ tục
zh_hans: 存储过程名称
zh_hant: 預存程序名稱

source: Procedure: %@
ar: الإجراء: %@
de: Prozedur: %@
es: Procedimiento: %@
fr: Procédure : %@
hi: प्रोसीज़र: %@
id: Prosedur: %@
it: Procedura: %@
ja: プロシージャ: %@
ko: 프로시저: %@
pl: Procedura: %@
pt_br: Procedimento: %@
ru: Процедура: %@
th: โพรซีเจอร์: %@
vi: Thủ tục: %@
zh_hans: 存储过程：%@
zh_hant: 預存程序：%@

source: Procedures
ar: الإجراءات
de: Prozeduren
es: Procedimientos
fr: Procédures
hi: प्रोसीज़र
id: Prosedur
it: Procedure
ja: プロシージャ
ko: 프로시저
pl: Procedury
pt_br: Procedimentos
ru: Процедуры
th: โพรซีเจอร์
tr: Procedure'lar
vi: Thủ tục
zh_hans: 存储过程
zh_hant: 預存程序

source: Procedures group
ar: مجموعة الإجراءات
de: Prozedurgruppe
es: Grupo de Procedimientos
fr: Groupe de procédures
hi: प्रोसीज़र समूह
id: Grup prosedur
it: Gruppo procedure
ja: プロシージャグループ
ko: 프로시저 그룹
pl: Grupa procedur
pt_br: Grupo de procedimentos
ru: Группа процедур
th: กลุ่มโพรซีเจอร์
tr: Procedure'lar grubu
vi: Nhóm thủ tục
zh_hans: 存储过程组
zh_hant: 預存程序群組

source: Query completed, no results.
ar: اكتمل الاستعلام، لا توجد نتائج.
de: Abfrage abgeschlossen, keine Ergebnisse.
es: Consulta completada, sin resultados.
fr: Requête terminée, aucun résultat.
hi: क्वेरी पूर्ण, कोई परिणाम नहीं।
id: Query selesai, tidak ada hasil.
it: Query completata, nessun risultato.
ja: クエリは完了しましたが、結果はありません。
ko: 쿼리가 완료되었지만 결과가 없습니다.
pl: Zapytanie ukończone, brak wyników.
pt_br: Consulta concluída, sem resultados.
ru: Запрос выполнен, результатов нет.
th: คำสั่งทำงานเสร็จแล้ว ไม่มีผลลัพธ์
tr: Sorgu tamamlandı, sonuç yok.
vi: Câu lệnh đã hoàn tất, không có kết quả.
zh_hans: 查询已完成，无结果。
zh_hant: 查詢已完成，沒有結果。

source: Query history
ar: سجل الاستعلامات
de: Abfrageverlauf
es: Historial de consultas
fr: Historique des requêtes
hi: क्वेरी इतिहास
id: Riwayat query
it: Cronologia query
ja: クエリ履歴
ko: 쿼리 기록
pl: Historia zapytań
pt_br: Histórico de consultas
ru: История запросов
th: ประวัติคำสั่ง
tr: Sorgu geçmişi
vi: Lịch sử câu lệnh
zh_hans: 查询历史记录
zh_hant: 查詢記錄

source: READ FROM FILE
ar: القراءة من ملف
de: AUS DATEI LESEN
es: LEER DESDE ARCHIVO
fr: LIRE DEPUIS UN FICHIER
hi: फ़ाइल से पढ़ें
id: BACA DARI FILE
it: LEGGI DA FILE
ja: ファイルから読み込み
ko: 파일에서 읽기
pl: ODCZYT Z PLIKU
pt_br: LER DO ARQUIVO
ru: ЧТЕНИЕ ИЗ ФАЙЛА
th: อ่านจากไฟล์
tr: DOSYADAN OKU
vi: ĐỌC TỪ TỆP
zh_hans: 从文件读取
zh_hant: 從檔案讀取

source: Read Only
ar: للقراءة فقط
de: Schreibgeschützt
es: Solo Lectura
fr: Lecture seule
hi: केवल पढ़ने के लिए
id: Hanya Baca
it: Sola lettura
ja: 読み取り専用
ko: 읽기 전용
pl: Tylko do odczytu
pt_br: Somente leitura
ru: Только чтение
th: อ่านอย่างเดียว
tr: Salt Okunur
vi: Chỉ đọc
zh_hans: 只读
zh_hant: 唯讀

source: Redo (⇧⌘Z)
ar: إعادة (⇧⌘Z)
de: Wiederholen (⇧⌘Z)
es: Rehacer (⇧⌘Z)
fr: Rétablir (⇧⌘Z)
hi: फिर से करें (⇧⌘Z)
id: Ulangi (⇧⌘Z)
it: Ripeti (⇧⌘Z)
ja: やり直す (⇧⌘Z)
ko: 다시 실행 (⇧⌘Z)
pl: Ponów (⇧⌘Z)
pt_br: Refazer (⇧⌘Z)
ru: Повторить (⇧⌘Z)
th: ทำซ้ำ (⇧⌘Z)
tr: Yinele (⇧⌘Z)
vi: Làm lại (⇧⌘Z)
zh_hans: 重做 (⇧⌘Z)
zh_hant: 重做 (⇧⌘Z)

source: Refresh
ar: تحديث
de: Aktualisieren
es: Actualizar
fr: Actualiser
hi: रीफ़्रेश करें
id: Segarkan
it: Aggiorna
ja: 更新
ko: 새로고침
pl: Odśwież
pt_br: Atualizar
ru: Обновить
th: รีเฟรช
tr: Yenile
vi: Làm mới
zh_hans: 刷新
zh_hant: 重新整理

source: Reset to Defaults
ar: إعادة التعيين إلى الافتراضي
de: Auf Standardwerte Zurücksetzen
es: Restablecer Valores Predeterminados
fr: Rétablir les valeurs par défaut
hi: डिफ़ॉल्ट पर रीसेट करें
id: Reset ke Default
it: Ripristina predefiniti
ja: デフォルトに戻す
ko: 기본값으로 재설정
pl: Przywróć domyślne
pt_br: Restaurar padrões
ru: Сбросить к значениям по умолчанию
th: รีเซ็ตเป็นค่าเริ่มต้น
tr: Varsayılanlara Sıfırla
vi: Đặt lại Mặc định
zh_hans: 恢复默认设置
zh_hant: 重設為預設值

source: Restart
ar: إعادة التشغيل
de: Neu Starten
es: Reiniciar
fr: Redémarrer
hi: पुनः आरंभ करें
id: Mulai Ulang
it: Riavvia
ja: 再起動
ko: 다시 시작
pl: Uruchom ponownie
pt_br: Reiniciar
ru: Перезапустить
th: รีสตาร์ท
tr: Yeniden Başlat
vi: Khởi động lại
zh_hans: 重新启动
zh_hant: 重新啟動

source: Restart Required
ar: إعادة التشغيل مطلوبة
de: Neustart Erforderlich
es: Reinicio Necesario
fr: Redémarrage requis
hi: पुनः आरंभ आवश्यक
id: Perlu Dimulai Ulang
it: Riavvio necessario
ja: 再起動が必要です
ko: 다시 시작 필요
pl: Wymagane ponowne uruchomienie
pt_br: Reinicialização necessária
ru: Требуется перезапуск
th: ต้องรีสตาร์ท
tr: Yeniden Başlatma Gerekli
vi: Cần Khởi động lại
zh_hans: 需要重新启动
zh_hant: 需要重新啟動

source: Restart the app for the language change to take effect.
ar: أعد تشغيل التطبيق لتفعيل تغيير اللغة.
de: Starten Sie die App neu, damit die Sprachänderung wirksam wird.
es: Reinicia la app para que el cambio de idioma surta efecto.
fr: Redémarrez l'application pour que le changement de langue prenne effet.
hi: भाषा परिवर्तन प्रभावी होने के लिए ऐप को पुनः आरंभ करें।
id: Mulai ulang aplikasi agar perubahan bahasa berlaku.
it: Riavvia l'app affinché la modifica della lingua abbia effetto.
ja: 言語の変更を反映するには、アプリを再起動してください。
ko: 언어 변경 사항을 적용하려면 앱을 다시 시작하세요.
pl: Uruchom aplikację ponownie, aby zmiana języka zaczęła obowiązywać.
pt_br: Reinicie o aplicativo para que a mudança de idioma tenha efeito.
ru: Перезапустите приложение, чтобы изменение языка вступило в силу.
th: รีสตาร์ทแอปเพื่อให้การเปลี่ยนภาษามีผล
tr: Dil değişikliğinin geçerli olması için uygulamayı yeniden başlatın.
vi: Khởi động lại ứng dụng để thay đổi ngôn ngữ có hiệu lực.
zh_hans: 重新启动应用以使语言更改生效。
zh_hant: 請重新啟動應用程式以套用語言變更。

source: Result %lld (%lld)
ar: النتيجة %lld (%lld)
de: Ergebnis %lld (%lld)
es: Resultado %lld (%lld)
fr: Résultat %lld (%lld)
hi: परिणाम %lld (%lld)
id: Hasil %lld (%lld)
it: Risultato %lld (%lld)
ja: 結果 %lld (%lld)
ko: 결과 %lld (%lld)
pl: Wynik %lld (%lld)
pt_br: Resultado %lld (%lld)
ru: Результат %lld (%lld)
th: ผลลัพธ์ %lld (%lld)
tr: Sonuç %lld (%lld)
vi: Kết quả %lld (%lld)
zh_hans: 结果 %lld (%lld)
zh_hant: 結果 %lld (%lld)

source: Row height
ar: ارتفاع الصف
de: Zeilenhöhe
es: Altura de fila
fr: Hauteur de ligne
hi: पंक्ति ऊँचाई
id: Tinggi baris
it: Altezza riga
ja: 行の高さ
ko: 행 높이
pl: Wysokość wiersza
pt_br: Altura da linha
ru: Высота строки
th: ความสูงแถว
tr: Satır yüksekliği
vi: Chiều cao hàng
zh_hans: 行高
zh_hant: 列高

source: Row spacing
ar: تباعد الصفوف
de: Zeilenabstand
es: Espaciado de fila
fr: Espacement des lignes
hi: पंक्ति स्पेसिंग
id: Jarak baris
it: Spaziatura righe
ja: 行間隔
ko: 행 간격
pl: Odstęp między wierszami
pt_br: Espaçamento entre linhas
ru: Межстрочный интервал
th: ระยะห่างระหว่างแถว
tr: Satır aralığı
vi: Khoảng cách hàng
zh_hans: 行间距
zh_hant: 列間距

source: Run
ar: تشغيل
de: Ausführen
es: Ejecutar
fr: Exécuter
hi: चलाएँ
id: Jalankan
it: Esegui
ja: 実行
ko: 실행
pl: Uruchom
pt_br: Executar
ru: Выполнить
th: รัน
tr: Çalıştır
vi: Chạy
zh_hans: 运行
zh_hant: 執行

source: Run All
ar: تشغيل الكل
de: Alles Ausführen
es: Ejecutar Todo
fr: Tout exécuter
hi: सभी चलाएँ
id: Jalankan Semua
it: Esegui tutto
ja: すべて実行
ko: 전체 실행
pl: Uruchom wszystko
pt_br: Executar tudo
ru: Выполнить всё
th: รันทั้งหมด
tr: Tümünü Çalıştır
vi: Chạy Tất cả
zh_hans: 全部运行
zh_hant: 全部執行

source: Run SQL Query
ar: تشغيل استعلام SQL
de: SQL-Abfrage Ausführen
es: Ejecutar Consulta SQL
fr: Exécuter la requête SQL
hi: SQL क्वेरी चलाएँ
id: Jalankan SQL Query
it: Esegui query SQL
ja: SQL クエリを実行
ko: SQL 쿼리 실행
pl: Uruchom zapytanie SQL
pt_br: Executar consulta SQL
ru: Выполнить SQL-запрос
th: รัน SQL Query
tr: SQL Sorgusu Çalıştır
vi: Chạy SQL Query
zh_hans: 运行 SQL 查询
zh_hant: 執行 SQL 查詢

source: Runs each ";"-separated statement in order without DELIMITER (⇧⌘↩). A CREATE PROCEDURE/FUNCTION/TRIGGER with a BEGIN…END body still needs DELIMITER.
ar: ينفّذ كل عبارة مفصولة بـ ";" بالترتيب دون DELIMITER (⇧⌘↩). لا يزال CREATE PROCEDURE/FUNCTION/TRIGGER الذي يحتوي على نص BEGIN…END يحتاج إلى DELIMITER.
de: Führt jede durch „;“ getrennte Anweisung der Reihe nach ohne DELIMITER aus (⇧⌘↩). Ein CREATE PROCEDURE/FUNCTION/TRIGGER mit einem BEGIN…END-Rumpf benötigt weiterhin DELIMITER.
es: Ejecuta en orden cada instrucción separada por ";" sin DELIMITER (⇧⌘↩). Un CREATE PROCEDURE/FUNCTION/TRIGGER con cuerpo BEGIN…END sigue necesitando DELIMITER.
fr: Exécute dans l'ordre chaque instruction séparée par « ; » sans DELIMITER (⇧⌘↩). Un CREATE PROCEDURE/FUNCTION/TRIGGER avec un corps BEGIN…END nécessite toujours DELIMITER.
hi: हर ";"-विभाजित कथन को क्रम से बिना DELIMITER के चलाता है (⇧⌘↩)। BEGIN…END बॉडी वाले CREATE PROCEDURE/FUNCTION/TRIGGER को अब भी DELIMITER चाहिए।
id: Menjalankan setiap pernyataan yang dipisahkan ";" secara berurutan tanpa DELIMITER (⇧⌘↩). CREATE PROCEDURE/FUNCTION/TRIGGER dengan isi BEGIN…END tetap memerlukan DELIMITER.
it: Esegue in ordine ogni istruzione separata da ";" senza DELIMITER (⇧⌘↩). Un CREATE PROCEDURE/FUNCTION/TRIGGER con corpo BEGIN…END richiede comunque DELIMITER.
ja: 「;」で区切られた各文を DELIMITER なしで順番に実行します (⇧⌘↩)。BEGIN…END 本体を持つ CREATE PROCEDURE/FUNCTION/TRIGGER には引き続き DELIMITER が必要です。
ko: ";"로 구분된 각 문을 DELIMITER 없이 순서대로 실행합니다 (⇧⌘↩). BEGIN…END 본문이 있는 CREATE PROCEDURE/FUNCTION/TRIGGER는 여전히 DELIMITER가 필요합니다.
pl: Uruchamia po kolei każdą instrukcję rozdzieloną „;” bez DELIMITER (⇧⌘↩). CREATE PROCEDURE/FUNCTION/TRIGGER z treścią BEGIN…END nadal wymaga DELIMITER.
pt_br: Executa cada instrução separada por ";" em ordem, sem DELIMITER (⇧⌘↩). Um CREATE PROCEDURE/FUNCTION/TRIGGER com corpo BEGIN…END ainda precisa de DELIMITER.
ru: Выполняет по порядку каждую инструкцию, разделённую «;», без DELIMITER (⇧⌘↩). Для CREATE PROCEDURE/FUNCTION/TRIGGER с телом BEGIN…END DELIMITER всё же нужен.
th: รันคำสั่งที่คั่นด้วย ";" ทีละคำสั่งตามลำดับโดยไม่ต้องใช้ DELIMITER (⇧⌘↩) แต่ CREATE PROCEDURE/FUNCTION/TRIGGER ที่มีเนื้อหา BEGIN…END ยังคงต้องใช้ DELIMITER
tr: Her ";" ile ayrılmış ifadeyi DELIMITER olmadan sırayla çalıştırır (⇧⌘↩). BEGIN…END gövdeli bir CREATE PROCEDURE/FUNCTION/TRIGGER için hâlâ DELIMITER gerekir.
vi: Chạy lần lượt từng câu lệnh phân tách bởi ";" mà không cần DELIMITER (⇧⌘↩). CREATE PROCEDURE/FUNCTION/TRIGGER có phần thân BEGIN…END vẫn cần DELIMITER.
zh_hans: 按顺序执行以“;”分隔的每条语句，无需 DELIMITER (⇧⌘↩)。带有 BEGIN…END 主体的 CREATE PROCEDURE/FUNCTION/TRIGGER 仍需要 DELIMITER。
zh_hant: 依序執行以「;」分隔的每條語句，不需要 DELIMITER (⇧⌘↩)。含有 BEGIN…END 主體的 CREATE PROCEDURE/FUNCTION/TRIGGER 仍需要 DELIMITER。

source: Runs the selected text if there is one, otherwise the whole query (⌘↩)
ar: ينفّذ النص المحدد إن وُجد، وإلا فينفّذ الاستعلام كاملًا (⌘↩)
de: Führt den ausgewählten Text aus, falls vorhanden, sonst die gesamte Abfrage (⌘↩)
es: Ejecuta el texto seleccionado si lo hay; si no, toda la consulta (⌘↩)
fr: Exécute le texte sélectionné s'il y en a un, sinon toute la requête (⌘↩)
hi: यदि चयनित टेक्स्ट है तो उसे चलाता है, अन्यथा पूरी क्वेरी (⌘↩)
id: Menjalankan teks yang dipilih jika ada, jika tidak menjalankan seluruh query (⌘↩)
it: Esegue il testo selezionato, se presente, altrimenti l'intera query (⌘↩)
ja: 選択したテキストがあればそれを実行し、なければクエリ全体を実行します (⌘↩)
ko: 선택한 텍스트가 있으면 실행하고, 없으면 전체 쿼리를 실행합니다 (⌘↩)
pl: Uruchamia zaznaczony tekst, jeśli istnieje, w przeciwnym razie całe zapytanie (⌘↩)
pt_br: Executa o texto selecionado, se houver, caso contrário, a consulta inteira (⌘↩)
ru: Выполняет выделенный текст, если он есть, иначе весь запрос (⌘↩)
th: รันข้อความที่เลือกไว้ถ้ามี มิฉะนั้นจะรันคำสั่งทั้งหมด (⌘↩)
tr: Seçili metin varsa yalnızca onu, yoksa tüm sorguyu çalıştırır (⌘↩)
vi: Chạy đoạn văn bản đã chọn nếu có, nếu không sẽ chạy toàn bộ câu lệnh (⌘↩)
zh_hans: 如有选中文本则运行该文本，否则运行整个查询 (⌘↩)
zh_hant: 若有選取文字則執行該文字，否則執行整個查詢 (⌘↩)

source: SAVE TO FILE
ar: الحفظ في ملف
de: IN DATEI SPEICHERN
es: GUARDAR EN ARCHIVO
fr: ENREGISTRER DANS UN FICHIER
hi: फ़ाइल में सहेजें
id: SIMPAN KE FILE
it: SALVA SU FILE
ja: ファイルに保存
ko: 파일로 저장
pl: ZAPISZ DO PLIKU
pt_br: SALVAR EM ARQUIVO
ru: СОХРАНИТЬ В ФАЙЛ
th: บันทึกลงไฟล์
tr: DOSYAYA KAYDET
vi: LƯU VÀO TỆP
zh_hans: 保存到文件
zh_hant: 儲存至檔案

source: SHEET
ar: الورقة
de: BLATT
es: HOJA
fr: FEUILLE
hi: शीट
id: LEMBAR
it: FOGLIO
ja: シート
ko: 시트
pl: ARKUSZ
pt_br: PLANILHA
ru: ЛИСТ
th: ชีต
tr: SAYFA
vi: TRANG TÍNH
zh_hans: 工作表
zh_hant: 工作表

source: SQL Editor
ar: محرر SQL
es: Editor SQL
fr: Éditeur SQL
hi: SQL संपादक
id: Editor SQL
it: Editor SQL
ja: SQL エディタ
ko: SQL 편집기
pl: Edytor SQL
pt_br: Editor SQL
ru: Редактор SQL
th: ตัวแก้ไข SQL
tr: SQL Editörü
vi: Trình soạn thảo SQL
zh_hans: SQL 编辑器
zh_hant: SQL 編輯器

source: SQL PREVIEW
ar: معاينة SQL
de: SQL-VORSCHAU
es: VISTA PREVIA DE SQL
fr: APERÇU SQL
hi: SQL पूर्वावलोकन
id: PRATINJAU SQL
it: ANTEPRIMA SQL
ja: SQL プレビュー
ko: SQL 미리보기
pl: PODGLĄD SQL
pt_br: PRÉVIA DO SQL
ru: ПРЕДПРОСМОТР SQL
th: ตัวอย่าง SQL
tr: SQL ÖNİZLEME
vi: XEM TRƯỚC SQL
zh_hans: SQL 预览
zh_hant: SQL 預覽

source: SQL Query
ar: استعلام SQL
de: SQL-Abfrage
es: Consulta SQL
fr: Requête SQL
hi: SQL क्वेरी
it: Query SQL
ja: SQL クエリ
ko: SQL 쿼리
pl: Zapytanie SQL
pt_br: Consulta SQL
ru: SQL-запрос
tr: SQL Sorgusu
zh_hans: SQL 查询
zh_hant: SQL 查詢

source: Save password
ar: حفظ كلمة المرور
de: Passwort speichern
es: Guardar contraseña
fr: Enregistrer le mot de passe
hi: पासवर्ड सहेजें
id: Simpan kata sandi
it: Salva password
ja: パスワードを保存
ko: 비밀번호 저장
pl: Zapisz hasło
pt_br: Salvar senha
ru: Сохранить пароль
th: บันทึกรหัสผ่าน
tr: Şifreyi sakla
vi: Lưu mật khẩu
zh_hans: 保存密码
zh_hant: 儲存密碼

source: Save query history
ar: حفظ سجل الاستعلامات
de: Abfrageverlauf speichern
es: Guardar historial de consultas
fr: Enregistrer l'historique des requêtes
hi: क्वेरी इतिहास सहेजें
id: Simpan riwayat query
it: Salva cronologia query
ja: クエリ履歴を保存
ko: 쿼리 기록 저장
pl: Zapisuj historię zapytań
pt_br: Salvar histórico de consultas
ru: Сохранять историю запросов
th: บันทึกประวัติคำสั่ง
tr: Sorgu geçmişini kaydet
vi: Lưu lịch sử câu lệnh
zh_hans: 保存查询历史记录
zh_hant: 儲存查詢記錄

source: Saved Connections
ar: الاتصالات المحفوظة
de: Gespeicherte Verbindungen
es: Conexiones Guardadas
fr: Connexions enregistrées
hi: सहेजे गए कनेक्शन
id: Koneksi Tersimpan
it: Connessioni salvate
ja: 保存済みの接続
ko: 저장된 연결
pl: Zapisane połączenia
pt_br: Conexões salvas
ru: Сохранённые подключения
th: การเชื่อมต่อที่บันทึกไว้
tr: Kayıtlı Bağlantılar
vi: Kết nối Đã lưu
zh_hans: 已保存的连接
zh_hant: 已儲存的連線

source: Schema (CREATE TABLE IF NOT EXISTS) and data (INSERT INTO) are exported together.
ar: يتم تصدير المخطط (CREATE TABLE IF NOT EXISTS) والبيانات (INSERT INTO) معًا.
de: Schema (CREATE TABLE IF NOT EXISTS) und Daten (INSERT INTO) werden zusammen exportiert.
es: El esquema (CREATE TABLE IF NOT EXISTS) y los datos (INSERT INTO) se exportan juntos.
fr: Le schéma (CREATE TABLE IF NOT EXISTS) et les données (INSERT INTO) sont exportés ensemble.
hi: स्कीमा (CREATE TABLE IF NOT EXISTS) और डेटा (INSERT INTO) एक साथ निर्यात किए जाते हैं।
id: Skema (CREATE TABLE IF NOT EXISTS) dan data (INSERT INTO) diekspor bersamaan.
it: Lo schema (CREATE TABLE IF NOT EXISTS) e i dati (INSERT INTO) vengono esportati insieme.
ja: スキーマ (CREATE TABLE IF NOT EXISTS) とデータ (INSERT INTO) は一緒にエクスポートされます。
ko: 스키마(CREATE TABLE IF NOT EXISTS)와 데이터(INSERT INTO)가 함께 내보내집니다.
pl: Schemat (CREATE TABLE IF NOT EXISTS) i dane (INSERT INTO) są eksportowane razem.
pt_br: O esquema (CREATE TABLE IF NOT EXISTS) e os dados (INSERT INTO) são exportados juntos.
ru: Схема (CREATE TABLE IF NOT EXISTS) и данные (INSERT INTO) экспортируются вместе.
th: โครงสร้าง (CREATE TABLE IF NOT EXISTS) และข้อมูล (INSERT INTO) จะถูกส่งออกพร้อมกัน
tr: Şema (CREATE TABLE IF NOT EXISTS) ve veri (INSERT INTO) birlikte dışa aktarılır.
vi: Lược đồ (CREATE TABLE IF NOT EXISTS) và dữ liệu (INSERT INTO) được xuất cùng nhau.
zh_hans: 架构 (CREATE TABLE IF NOT EXISTS) 和数据 (INSERT INTO) 会一起导出。
zh_hant: 結構描述 (CREATE TABLE IF NOT EXISTS) 與資料 (INSERT INTO) 會一併匯出。

source: Select All
ar: تحديد الكل
de: Alle Auswählen
es: Seleccionar Todo
fr: Tout sélectionner
hi: सभी चुनें
id: Pilih Semua
it: Seleziona tutto
ja: すべて選択
ko: 전체 선택
pl: Zaznacz wszystko
pt_br: Selecionar tudo
ru: Выбрать всё
th: เลือกทั้งหมด
tr: Tümünü Seç
vi: Chọn Tất cả
zh_hans: 全选
zh_hant: 全選

source: Select a table
ar: اختر جدولًا
de: Wählen Sie eine Tabelle aus
es: Selecciona una tabla
fr: Sélectionner une table
hi: एक टेबल चुनें
id: Pilih tabel
it: Seleziona una tabella
ja: テーブルを選択してください
ko: 테이블을 선택하세요
pl: Wybierz tabelę
pt_br: Selecione uma tabela
ru: Выберите таблицу
th: เลือกตาราง
tr: Bir tablo seçin
vi: Chọn một bảng
zh_hans: 选择一个表
zh_hant: 選取一個表格

source: Select column
ar: اختيار عمود
de: Spalte auswählen
es: Seleccionar columna
fr: Sélectionner une colonne
hi: कॉलम चुनें
id: Pilih kolom
it: Seleziona colonna
ja: 列を選択
ko: 열 선택
pl: Wybierz kolumnę
pt_br: Selecionar coluna
ru: Выберите столбец
th: เลือกคอลัมน์
tr: Sütun seç
vi: Chọn cột
zh_hans: 选择列
zh_hant: 選取欄位

source: Selected row background color
ar: لون خلفية الصف المحدد
de: Hintergrundfarbe der ausgewählten Zeile
es: Color de fondo de fila seleccionada
fr: Couleur de fond de la ligne sélectionnée
hi: चयनित पंक्ति पृष्ठभूमि रंग
id: Warna latar baris terpilih
it: Colore sfondo riga selezionata
ja: 選択行の背景色
ko: 선택한 행 배경 색상
pl: Kolor tła zaznaczonego wiersza
pt_br: Cor de fundo da linha selecionada
ru: Цвет фона выбранной строки
th: สีพื้นหลังของแถวที่เลือก
tr: Seçili satır zemin rengi
vi: Màu nền hàng được chọn
zh_hans: 选中行背景颜色
zh_hant: 選取列背景顏色
